In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

%load_ext sql

#### Query data with sql

In [ ]:
host = "127.0.0.1"
user = "postgres"
password = "password"
database = 'dvdrental'
port = 5432

connection_string = "postgresql://{user}:{password}@{host}:{port}/{database}".\
                    format(user=user, password=password, host=host, database=database, port=port)

# postgresql://username:password@hostname/dbname

%sql $connection_string

1. Câu 1

In [ ]:
%sql SELECT first_name, last_name FROM customer WHERE last_name = 'Smith'

2. Câu 2

In [ ]:
%sql SELECT title, length FROM film WHERE length > 120

3. Cau 3

In [ ]:
%sql SELECT SUM(amount) AS total_amount FROM payment

4. Cau 4

In [ ]:
%sql SELECT title, rental_rate FROM film ORDER BY rental_rate DESC LIMIT 10

5. Cau 5

In [ ]:
%sql SELECT a.first_name, a.last_name, count(fa.film_id) FROM actor a JOIN film_actor fa ON a.actor_id = fa.actor_id GROUP BY a.first_name, a.last_name

6.Cau 6

In [ ]:
%%sql 
SELECT f.title, c.name 
FROM film f JOIN film_category fa ON f.film_id = fa.film_id 
            JOIN category c ON fa.category_id = c.category_id

7. Cau 7

In [ ]:
%%sql 
SELECT c.first_name, c.last_name, count(r.customer_id) AS rental_count
FROM customer c JOIN rental r ON c.customer_id = r.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY rental_count DESC

8. Cau 8

In [ ]:
%%sql 
SELECT f.title, count(r.inventory_id) AS rental_count
FROM film f JOIN inventory i ON f.film_id = i.film_id
            JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY rental_COUNT DESC

9.Cau 9

In [ ]:
%%sql
WITH temp AS (
SELECT c.first_name, c.last_name, i.film_id,(r.return_date - r.rental_date) AS late_days
FROM customer c JOIN rental r ON c.customer_id = r.customer_id
                JOIN inventory i ON r.inventory_id = i.inventory_id
				JOIN film f ON f.film_id = i.film_id)
SELECT first_name, last_name, late_days
FROM temp              
WHERE late_days IS NOT NULL

10. Cau 10

In [ ]:
%sql SELECT COUNT(DISTINCT customer_id ) FROM payment

11. Cau 11

In [ ]:
%%sql 
SELECT s.store_id, COUNT(p.payment_id) AS transaction_count
FROM store s JOIN staff st ON s.store_id = st.store_id
            JOIN payment p ON st.staff_id = p.staff_id
GROUP BY s.store_id

12. Cau 12

In [ ]:
%sql SELECT store_id, count(*) FROM inventory GROUP BY store_id

13. Cau 13

In [ ]:
%%sql
SELECT f.title, count(fa.film_id) AS actor_count
FROM film f JOIN film_actor fa ON f.film_id = fa.film_id
GROUP BY f.title
ORDER BY actor_count DESC

14. Cau 14

In [ ]:
%%sql
SELECT f.title
FROM film f JOIN film_category fa ON f.film_id = fa.film_id
            JOIN category c ON fa.category_id = c.category_id
WHERE c.name = 'Children'

15. Cau 15

In [ ]:
%%sql 
SELECT c.city 
FROM city c JOIN address a ON c.city_id = a.city_id
            JOIN customer cu ON a.city_id = cu.address_id

16. Cau 16

In [ ]:
%%sql 
SELECT c.first_name, c.last_name, sum(p.amount) AS total_payment
FROM customer c JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY total_payment DESC

17. Cau 17

In [ ]:
%%sql 
SELECT c.city, sum(p.amount) AS total_revenue
FROM city c JOIN address a ON c.city_id = a.city_id
            JOIN customer cu ON cu.address_id = a.address_id
            JOIN payment p ON cu.customer_id = p.customer_id
GROUP BY c.city
HAVING c.city = 'Nha Trang'

18. Cau 18

In [ ]:
%%sql
WITH CustomerCategories AS (
    SELECT c.customer_id, fa.category_id
    FROM customer c JOIN rental r ON c.customer_id = r.customer_id
                    JOIN inventory i ON r.inventory_id = i.inventory_id
                    JOIN film_category fa ON i.film_id = fa.film_id
)

SELECT c.first_name, c.last_name
FROM customer c JOIN CustomerCategories cc ON c.customer_id = cc.customer_id
GROUP BY c.first_name, c.last_name
HAVING COUNT(DISTINCT cc.category_id) = (SELECT COUNT(DISTINCT category_id) FROM category)

19. Cau 19

In [ ]:
%%sql result <<
SELECT c.name AS category_name, COUNT(fa.film_id) AS film_count
FROM category c JOIN film_category fa ON c.category_id = fa.category_id
GROUP BY c.name
ORDER BY film_count DESC

In [ ]:
df = result.DataFrame()
df

In [ ]:
plt.figure(figsize=(12,6))
sns.barplot(data=df,x="category_name",y='film_count')
plt.title("Số lượng phim trong từng thể loại")
plt.xlabel("Thể loại")
plt.ylabel("Số lượng phim")
plt.xticks(rotation = 40)
plt.show()

20. Cau 20

In [ ]:
%%sql result2 <<
SELECT c.city, sum(p.amount) AS total_revenue
FROM city c JOIN address a ON c.city_id = a.city_id
            JOIN customer cu ON cu.address_id = a.address_id
            JOIN payment p ON cu.customer_id = p.customer_id
GROUP BY c.city
ORDER BY total_revenue DESC LIMIT 20

In [ ]:
df2 = result2.DataFrame()
df2

In [ ]:
plt.figure(figsize=(12,6))
sns.barplot(data=df2, x="total_revenue", y="city")
plt.title("Tổng doanh thu cao nhất của 20 thành phố từ các khách hàng")
plt.xlabel("Doanh thu(USD)")
plt.ylabel("Thành phố")
plt.show()